/**
 * Да се напише програмен фрагмент, който решава задачата:
 * Въвежда символен низ с маскимална дължина от 10 символа. Извличането да продължава до разделителя '.' и да НЕ прескача '.' от водния поток.
 */
#include <iostream>

int main(){
char word[10];
while (true)//безкраен цикъл
{
    std::cin>>word;//въвеждане на дума
    for (size_t i = 0; i < 10; i++) if(word[i]=='.')goto End;
    //преминаване през всяка буква на думата и проверяване дали съдържа '.',при намерена точка се отива тук=>(1)
    //или просто се излиза от цикъла
}
End://(1)
system("pause");
return 0;

}