/**
 * Да се напише програмен фрагмент, който решава задачата:
 * Въвежда символен низ с маскимална дължина от 10 символа. Извличането да продължава до разделителя '.' и да прескача '.' от водния поток.
 */
#include <iostream>
int main(){
  bool has_dot=false;//създаване на променли която ще проверява дали думата съдържа '.'
  char word[10];
  while (true)
  {
      std::cin>>word;//въвеждане на дума
    for (size_t i = 0; i < 10; i++)
    {
        if(word[i]=='.')has_dot=true;//преминаване през всяка буква на думата и проверяване дали съдържа '.',
        //при намерена '.', променливата has_dot ще има стойност true
    }
    if (has_dot)goto End;//проверка на стойността на променливата и излизане от цикъла.
  }
  End:
  system("pause");
  return 0;
}